Tekla.Structures.Plugins.PluginBase.InputObjectDependency.NOT_DEPENDENT
No dependency on input. Typically this type is applied to the import and export functionality.
Not-dependent plug-ins are executed from the plug-in dialog instead of the component catalog.
The created objects do not have any relation to the plug-in anymore.
The plug-in dialog cannot be opened from the created objects.